In [14]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
inputs=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')

In [16]:
inputs.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [17]:
inputs_n=inputs.drop('Survived',axis='columns')

In [19]:
inputs_n.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [20]:
target=inputs.Survived

In [21]:
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [24]:
dummies=pd.get_dummies(inputs_n.Sex)

In [25]:
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [27]:
inputs_n=pd.concat([inputs_n,dummies],axis='columns')

In [28]:
inputs_n.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [37]:
inputs_n.drop(['Sex','male'],axis='columns',inplace=True)

In [38]:
inputs_n.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [40]:
inputs_n.columns[inputs_n.isna().any()]

Index(['Age'], dtype='object')

In [41]:
inputs_n.Age=inputs_n.Age.fillna(inputs_n.Age.mean())

In [42]:
inputs_n.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [43]:
inputs_n.columns[inputs_n.isna().any()]

Index([], dtype='object')

In [44]:
from sklearn.model_selection import train_test_split

In [51]:
x_train,x_test,y_train,y_test=train_test_split(inputs_n,target,test_size=0.2)

In [52]:
len(x_train)

712

In [53]:
len(x_test)

179

In [54]:
len(inputs_n)

891

In [55]:
#gaussian is also known by bell graph 

from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [56]:
model.fit(x_train,y_train)

GaussianNB()

In [57]:
model.score(x_test,y_test)

0.7932960893854749

In [60]:
model.predict(x_test.head(10))

array([0, 1, 1, 0, 0, 1, 1, 1, 1, 1], dtype=int64)

In [64]:
model.predict_proba(x_test.head(10))

array([[6.68064406e-01, 3.31935594e-01],
       [7.77883164e-03, 9.92221168e-01],
       [3.32806149e-01, 6.67193851e-01],
       [9.63297624e-01, 3.67023763e-02],
       [8.90846439e-01, 1.09153561e-01],
       [9.57864637e-05, 9.99904214e-01],
       [4.33716711e-01, 5.66283289e-01],
       [1.72208216e-02, 9.82779178e-01],
       [4.21126525e-03, 9.95788735e-01],
       [3.10390686e-02, 9.68960931e-01]])

In [72]:
#by using cross val score
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),x_train, y_train, cv=5)

array([0.78321678, 0.79020979, 0.75352113, 0.72535211, 0.78169014])

In [73]:
#mean
cross_val_score(GaussianNB(),x_train, y_train, cv=5).mean()

0.7667979907416528